Revit 2026 API

# ExternalResourceReference(Guid, IDictionaryString, String, String, String) Constructor

---

Initializes a new instance of the ExternalResourceReference class

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ExternalResourceReference(
	Guid serverId,
	IDictionary<string, string> referenceInformation,
	string version,
	string inSessionPath
)
```
```vb
Public Sub New (
	serverId As Guid,
	referenceInformation As IDictionary(Of String, String),
	version As String,
	inSessionPath As String
)
```
```cpp
public:
ExternalResourceReference(
	Guid serverId,
	IDictionary<String^, String^>^ referenceInformation,
	String^ version,
	String^ inSessionPath
)
```
```fsharp
new :
        serverId : Guid *
        referenceInformation : IDictionary<string, string> *
        version : string *
        inSessionPath : string -> ExternalResourceReference
```

#### Parameters

serverId Guid

referenceInformation IDictionaryString, String

version String

inSessionPath String

#### Reference

ExternalResourceReference Class

ExternalResourceReference Overload

Autodesk.Revit.DB Namespace